#+LANGUAGE: es
#+CATEGORY: manual, presentación, congreso, ponencia
#+TAGS: commandline, línea de comandos, ls, pwd, mkdir, cd, touch, cp, mv, stdin, stdout, stderr, posix, diff, grep, egrep, find, awk, sed
#+DESCRIPTION: Acometer un proyecto en Medialab-Prado
#+TITLE: Operaciones lógicas con datos
#+DATE: <2017-05-06 sáb 10:00>
#+AUTHOR: Adolfo A. Bravo y Pilar J. López
#+EMAIL: adolfo@medialab-prado.es y pilarjlopez@hotmail.com
#+OPTIONS: todo:nil pri:nil tags:nil ^:nil 

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIONS: toc:nil
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: linear
#+REVEAL_THEME: moon
#+REVEAL_HLEVEL: 2
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Org-Reveal Introduction.">
#+REVEAL_POSTAMBLE: <p> Creado por adolflow. </p>
#+REVEAL_PLUGINS: (highlight markdown notes)
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/


*** Ejecución del comando sin más
Para ejecutar el comando sin más, por ejemplo, =ls=, escríbelo y pulsa
=Enter= o =retorno de carro=

#+BEGIN_SRC sh :output org
ls

#+END_SRC

#+RESULTS:
| black_corrupcion.csv      |
| black-is-black_backup.csv |
| black-is-black.csv        |
| errores.txt               |
| Readme.html               |
| README.md                 |
| Readme.org                |
| Readme.org~               |
| suma.txt                  |

*** Comando más argumentos

En el caso de =ls=, podemos decirle que nos liste un archivo concreto,
por ejemplo:

#+BEGIN_SRC sh :output org
ls errores.txt

#+END_SRC

#+RESULTS:
: errores.txt

Otros comandos pueden requerir uno o más argumentos.

*** Comando con opciones

- Cada comando tiene múltiples opciones, y se pueden combinar.
- Las opciones se suelen escribir con una sigla que corresponde con
  una palabra, separado por un guión.
- Por ejemplo, si escribimos =ls -r=, listamos el directorio en orden
  inverso.

#+BEGIN_SRC sh :output org
ls -r

#+END_SRC

#+RESULTS:
| suma.txt                  |
| Readme.org~               |
| Readme.org                |
| README.md                 |
| Readme.html               |
| errores.txt               |
| black-is-black.csv        |
| black-is-black_backup.csv |
| black_corrupcion.csv      |

Nótese la diferencia con la ejecución anterior.

** =*=

Podemos listar todos los =csv= con el comodín =*=, ya que puede haber
archivos con un carácter o varios.

#+BEGIN_SRC sh :output org
ls *.csv

#+END_SRC

#+RESULTS:
| black_corrupcion.csv      |
| black-is-black_backup.csv |
| black-is-black.csv        |

** =[]=

El comodín corchetes cuadrados o =[]= permite buscar rangos de números
o letras.

si queremos buscar en el =csv= tanto =CLESA= como =BLESA=, podemos
escribir:

#+BEGIN_SRC sh :output org
grep [B-C]LESA black-is-black.csv | wc -l

#+END_SRC

#+RESULTS:
: 1650

*** find sobre directorio

En ese caso estamos en
=/home/flow/proyectos/operaciones-logicas-datos=, vamos a ver qué
contiene este directorio:

#+BEGIN_SRC sh
find

#+END_SRC

#+RESULTS:
| 0                           |
| ./.Readme.org.~242df0ee     |
| ./README.md                 |
| ./Readme.org                |
| ./.#Readme.org              |
| ./suma.txt                  |
| ./black_corrupcion.csv      |
| ./black-is-black.csv        |
| ./black-is-black_backup.csv |
| ./#Readme.org#              |
| ./Readme.org~               |
| ./errores.txt               |

** ejemplo find Readme.org
Vamos a buscar ahora todos los archivos =Readme.org= por debajo de un
directorio con la opción =-name= y voy a entubar la salida con a =wc -l= 

#+BEGIN_SRC sh :results output raw
find ~/ownCloud/proyectos/ -name Readme.org | wc -l
#+END_SRC

#+RESULTS:
74

** ejemplo find comodines
Y también podemos incluir /comodines/. Por ejemplo, si quisiéramos todos los
archivos =*.org=, no solo los que se llaman =Readme.org=:

#+BEGIN_SRC sh :results output raw replace
find ~/ownCloud/proyectos -name *.org | wc -l

#+END_SRC

#+RESULTS:
74
74
13

*** Ejemplo de éxito

En este ejemplo, la primera orden ofrece resultados, y por eso el
=echo= tiene sentido:
#+BEGIN_SRC sh :results html
grep BLESA black-is-black.csv | wc -l ; echo "líneas con la palabra BLESA...\n¡Qué pasada!"

#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
1650
líneas con la palabra BLESA...
¡Qué pasada!
#+END_EXPORT

*** Ejemplo fallido
En este ejemplo, no devuelve resultados porque no hay un archivo
llamado black. Sin embargo, aparece el mensaje a continuación como en
el primer caso, que resulta un poco incongruente.
#+BEGIN_SRC sh :results html
grep CLESA black; echo "líneas con la palabra CLESA...\n¡Qué pasada!"

#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
líneas con la palabra CLESA...
¡Qué pasada!
#+END_EXPORT


